Repository: ayatskii/k_z
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Home
ru: Главная

source: Dictionary
ru: Словарь

source: Lessons
ru: Уроки

source: About
ru: О нас

source: Contact
ru: Контакты

source: Login
ru: Войти

source: Register
ru: Регистрация

source: My Profile
ru: Мой профиль

source: Saved Words
ru: Сохраненные слова

source: Logout
ru: Выйти

source: Learn Kazakh language easily online
ru: Изучайте казахский язык легко онлайн

source: Learn Kazakh language with interactive lessons and exercises.
ru: Изучайте казахский язык с помощью интерактивных уроков и упражнений.

source: Learn Kazakh - Online Learning Platform
ru: Изучение казахского - Онлайн-платформа обучения

source: Learn Kazakh Language
ru: Изучайте казахский язык

source: Master Kazakh with our interactive lessons, quizzes, and vocabulary tools
ru: Осваивайте казахский язык с помощью интерактивных уроков, тестов и словарных инструментов

source: Start Learning
ru: Начать обучение

source: Explore Dictionary
ru: Исследовать словарь

source: Why Learn with Us?
ru: Почему учиться с нами?

source: Our platform offers the best tools to help you learn Kazakh effectively
ru: Наша платформа предлагает лучшие инструменты для эффективного изучения казахского языка

source: Structured Learning
ru: Структурированное обучение

source: Follow a well-structured curriculum designed by language experts from beginner to advanced levels.
ru: Следуйте хорошо структурированной программе, разработанной языковыми экспертами, от начального до продвинутого уровня.

source: Video Tutorials
ru: Видеоуроки

source: Learn with our comprehensive video lessons that explain grammar, vocabulary, and pronunciation.
ru: Учитесь с помощью наших комплексных видеоуроков, объясняющих грамматику, словарный запас и произношение.

source: Interactive Tests
ru: Интерактивные тесты

source: Practice what you've learned with interactive quizzes and track your progress over time.
ru: Практикуйте то, что вы выучили, с помощью интерактивных тестов и отслеживайте свой прогресс.

source: Featured Lessons
ru: Избранные уроки

source: View All Lessons
ru: Просмотреть все уроки

source: Start Lesson
ru: Начать урок

source: No featured lessons available yet. Check back soon!
ru: Избранные уроки пока недоступны. Проверьте позже!

source: Start Learning Kazakh
ru: Начать изучение казахского

source: Begin your journey to learn Kazakh with our comprehensive courses.
ru: Начните свой путь изучения казахского языка с нашими комплексными курсами.

source: View Lessons
ru: Просмотреть уроки

source: Watch Video Tutorials
ru: Смотреть видеоуроки

source: Learn with our detailed video tutorials and improve your pronunciation.
ru: Учитесь с помощью наших подробных видеоуроков и улучшайте свое произношение.

source: View Videos
ru: Смотреть видео

source: Take Tests
ru: Пройти тесты

source: Test your knowledge and track your progress with our interactive quizzes.
ru: Проверьте свои знания и отслеживайте прогресс с помощью наших интерактивных тестов.

source: Try Quizzes
ru: Попробовать тесты

source: About Us - Learn Kazakh
ru: О нас - Изучение казахского

source: About Learn Kazakh
ru: О проекте Изучение казахского

source: Our Mission
ru: Наша миссия

source: We are dedicated to making the Kazakh language accessible to everyone, regardless of their background or experience level.
ru: Мы стремимся сделать казахский язык доступным для всех, независимо от их происхождения или уровня опыта.

source: The Kazakh language is the state language of Kazakhstan and is spoken by millions of people. Our platform provides comprehensive resources for learning Kazakh in an engaging and interactive way. We believe that language learning should be enjoyable, practical, and suited to the modern learner's needs.
ru: Казахский язык является государственным языком Казахстана и на нем говорят миллионы людей. Наша платформа предоставляет комплексные ресурсы для изучения казахского языка увлекательным и интерактивным способом. Мы считаем, что изучение языка должно быть приятным, практичным и соответствовать потребностям современного ученика.

source: Our Approach
ru: Наш подход

source: Our teaching methodology is based on modern language learning techniques that focus on:
ru: Наша методика обучения основана на современных методах изучения языка, которые фокусируются на:

source: Practical communication skills
ru: Практические навыки общения

source: Cultural context and understanding
ru: Культурный контекст и понимание

source: Progressive learning from basic to advanced
ru: Прогрессивное обучение от базового до продвинутого уровня

source: Interactive exercises and immediate feedback
ru: Интерактивные упражнения и немедленная обратная связь

source: Audio and visual learning aids
ru: Аудио и визуальные средства обучения

source: Our Platform
ru: Наша платформа

source: Our platform offers:
ru: Наша платформа предлагает:

source: Structured lessons organized by proficiency levels (A1-C2)
ru: Структурированные уроки, организованные по уровням владения (A1-C2)

source: Video tutorials with native speakers
ru: Видеоуроки с носителями языка

source: Interactive tests and quizzes
ru: Интерактивные тесты и викторины

source: Comprehensive Kazakh-English dictionary
ru: Полный казахско-английский словарь

source: Progress tracking and learning analytics
ru: Отслеживание прогресса и аналитика обучения

source: Mobile-friendly interface for learning on the go
ru: Мобильный интерфейс для обучения в пути

source: Our Team
ru: Наша команда

source: Our team consists of professional linguists, native Kazakh speakers, educational technology experts, and language enthusiasts. Together, we work to create the best possible resources for learning the Kazakh language.
ru: Наша команда состоит из профессиональных лингвистов, носителей казахского языка, экспертов в области образовательных технологий и энтузиастов языка. Вместе мы работаем над созданием лучших ресурсов для изучения казахского языка.

source: We're constantly improving our platform based on user feedback and the latest research in language acquisition to provide the most effective learning experience.
ru: Мы постоянно совершенствуем нашу платформу на основе отзывов пользователей и последних исследований в области усвоения языка, чтобы обеспечить наиболее эффективный опыт обучения.

source: Get in Touch
ru: Свяжитесь с нами

source: We'd love to hear from you! Whether you have questions, suggestions, or just want to share your experience learning Kazakh with us, please feel free to
ru: Мы будем рады услышать от вас! Если у вас есть вопросы, предложения или вы просто хотите поделиться своим опытом изучения казахского языка с нами, пожалуйста,

source: contact us
ru: свяжитесь с нами

source: Contact Us - Learn Kazakh
ru: Связаться с нами - Изучение казахского

source: Contact Us
ru: Свяжитесь с нами

source: We'd love to hear from you! Fill out the form below and we'll get back to you as soon as possible.
ru: Мы будем рады услышать от вас! Заполните форму ниже, и мы свяжемся с вами как можно скорее.

source: Your Name
ru: Ваше имя

source: Please provide your name.
ru: Пожалуйста, укажите ваше имя.

source: Email Address
ru: Адрес электронной почты

source: Please provide a valid email address.
ru: Пожалуйста, укажите действительный адрес электронной почты.

source: Subject
ru: Тема

source: Please provide a subject.
ru: Пожалуйста, укажите тему.

source: Message
ru: Сообщение

source: Please provide a message.
ru: Пожалуйста, напишите сообщение.

source: Send Message
ru: Отправить сообщение

source: Email
ru: Электронная почта

source: Phone
ru: Телефон

source: Address
ru: Адрес

source: 123 Abay Avenue
ru: 123 проспект Абая

source: Almaty, Kazakhstan
ru: Алматы, Казахстан

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: How much does it cost to use Learn Kazakh?
ru: Сколько стоит использование платформы Изучение казахского?

source: Our basic learning resources are free for everyone. We also offer premium features for advanced learners that require a subscription.
ru: Наши базовые учебные ресурсы бесплатны для всех. Мы также предлагаем премиум-функции для продвинутых учеников, требующие подписки.

source: Do I need any prior knowledge of Kazakh to start?
ru: Нужны ли мне предварительные знания казахского языка, чтобы начать?

source: No, our courses start from absolute beginner (A1) level, so no prior knowledge is required.
ru: Нет, наши курсы начинаются с уровня абсолютного новичка (A1), поэтому предварительные знания не требуются.

source: How long will it take to become fluent in Kazakh?
ru: Сколько времени потребуется, чтобы свободно говорить на казахском языке?

source: The time to achieve fluency varies greatly depending on your background, dedication, and learning pace. With consistent practice, many learners reach conversational fluency within 1-2 years.
ru: Время достижения беглости сильно варьируется в зависимости от вашего опыта, преданности и темпа обучения. При регулярной практике многие ученики достигают разговорной беглости в течение 1-2 лет.

source: Categories
ru: Категории

source: Words in this category
ru: Слова в этой категории

source: Sort
ru: Сортировать

source: Search in category
ru: Поиск в категории

source: Kazakh
ru: Казахский

source: English
ru: Английский

source: Pronunciation
ru: Произношение

source: Actions
ru: Действия

source: View
ru: Просмотр

source: No words found in this category.
ru: В этой категории не найдено слов.

source: Search Results
ru: Результаты поиска

source: Search Results for
ru: Результаты поиска для

source: Search for words in Kazakh or English
ru: Поиск слов на казахском или английском

source: Search
ru: Поиск

source: Found
ru: Найдено

source: Word Details
ru: Детали слова

source: Word not found
ru: Слово не найдено

source: Listen
ru: Прослушать

source: Definition
ru: Определение

source: Examples
ru: Примеры

source: Related Words
ru: Связанные слова

source: Save Word
ru: Сохранить слово

source: Word Saved
ru: Слово сохранено

source: Back to Dictionary Home
ru: Назад на главную страницу словаря

source: The requested word was not found in our dictionary.
ru: Запрошенное слово не найдено в нашем словаре.

source: Learn Kazakh
ru: Изучение казахского

source: Completed
ru: Завершено

source: Saved
ru: Сохранено

source: Save Lesson
ru: Сохранить урок

source: Go to Test
ru: Перейти к тесту

source: Your Progress
ru: Ваш прогресс

source: Submit Answers
ru: Отправить ответы

source: Test
ru: Тест

source: Question
ru: Вопрос

source: Learn More
ru: Узнать больше

source: View Words
ru: Посмотреть слова

source: View All
ru: Посмотреть все

source: Browse Words
ru: Просмотр слов

source: Back to Dictionary
ru: Назад к словарю

source: Search for a word in Kazakh or English
ru: Поиск слова на казахском или русском

source: Explore Words
ru: Исследовать слова

source: Browse by Category
ru: Просмотр по категориям

source: Dictionary Categories
ru: Категории словаря

source: Browse words by category to help organize your learning.
ru: Просматривайте слова по категориям, чтобы организовать свое обучение.

source: No categories available yet. Check back later!
ru: Категории пока недоступны. Проверьте позже!

source: Kazakh (A-Z)
ru: Казахский (А-Я)

source: English (A-Z)
ru: Английский (А-Я)

source: Russian (A-Z)
ru: Русский (А-Я)

source: Russian
ru: Русский

source: Save
ru: Сохранить

source: Word Relationships
ru: Связи слова

source: Synonyms
ru: Синонимы

source: Antonyms
ru: Антонимы

source: Grammar Notes
ru: Грамматические заметки

source: No grammar notes available for this word.
ru: Для этого слова нет грамматических заметок.

source: Category not found
ru: Категория не найдена

source: The requested category was not found in our dictionary.
ru: Запрошенная категория не найдена в нашем словаре.

source: Qazaq Learn Dictionary
ru: Словарь казахского языка

source: Find and explore Kazakh words with translations, pronunciation guides, and examples.
ru: Ищите и изучайте казахские слова с переводами, руководствами по произношению и примерами.

source: words
ru: слова
